docs/posts/2017-08-17-a-new-school-year.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Jan 07, 2025 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>A New School Year</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/">Home</a></li>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/atom.xml">Feed</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">A New School Year</h1>
<p class="subtitle" role="doc-subtitle">Aug 17, 2017</p>
</header><p>
As this year&rsquo;s chairperson of the Faculty Council, I am privileged to open our first employee meeting with a reading from Scripture and a prayer. This year, our academic year begins one week after the horrific display of racism and violence in Charlottesville, Virginia. That event prompted my reflection on the following text.
</p>
<section id="outline-container-org62fa9f3" class="outline-2">
<h2 id="org62fa9f3">Colossians 3:1-15</h2>
<div class="outline-text-2" id="text-org62fa9f3">
<blockquote>
<p>
So if you have been raised with Christ, seek the things that are above, where Christ is, seated at the right hand of God. Set your minds on things that are above, not on things that are on earth, for you have died, and your life is hidden with Christ in God. When Christ who is your life is revealed, then you also will be revealed with him in glory.
</p>

<p>
Put to death, therefore, whatever in you is earthly: fornication, impurity, passion, evil desire, and greed (which is idolatry). On account of these the wrath of God is coming on those who are disobedient. These are the ways you also once followed, when you were living that life. But now you must get rid of all such things—anger, wrath, malice, slander, and abusive language from your mouth. Do not lie to one another, seeing that you have stripped off the old self with its practices and have clothed yourselves with the new self, which is being renewed in knowledge according to the image of its creator. In that renewal there is no longer Greek and Jew, circumcised and uncircumcised, barbarian, Scythian, slave and free; but Christ is all and in all!
</p>

<p>
As God’s chosen ones, holy and beloved, clothe yourselves with compassion, kindness, humility, meekness, and patience. Bear with one another and, if anyone has a complaint against another, forgive each other; just as the Lord has forgiven you, so you also must forgive. Above all, clothe yourselves with love, which binds everything together in perfect harmony. And let the peace of Christ rule in your hearts, to which indeed you were called in the one body. And be thankful.
</p>
</blockquote>
</div>
</section>
<section id="outline-container-orgd340560" class="outline-2">
<h2 id="orgd340560">Prayer</h2>
<div class="outline-text-2" id="text-orgd340560">
<p>
God of hope and Lord of life,
</p>

<p>
Thank you for this time<br>
to gather together<br>
as friends and colleagues<br>
to kindle the excitement<br>
and hope of a new beginning.
</p>

<p>
We give thanks and pray for our students,<br>
for they come here with hopes and dreams,<br>
and believe that this is the place where<br>
those hopes and dreams can become reality.
</p>

<p>
May they never leave thinking<br>
that their dreams were too big,<br>
but instead go from here<br>
with a new vision of their role<br>
in the redemptive story<br>
that is far greater than<br>
even they had ever dared to dream.
</p>

<p>
We pray for ourselves,<br>
that you would protect us from the temptations<br>
to answer too quickly,<br>
to respond with cynicism,<br>
and to serve the spirit that crushes hope,<br>
instead of our God who makes all things possible.
</p>

<p>
We pray for our nation,<br>
still reeling in shock<br>
from what we have seen this week.
</p>

<p>
The temptation is to despair,<br>
asking who are we,<br>
and what can we do<br>
when anger, wrath, and malice<br>
appear to win the day?
</p>

<p>
But we are those who have been raised with Christ,<br>
and of all people we should have hope,<br>
for we have been to the cross,<br>
and we have seen what love can do.
</p>

<p>
May our lives bear witness to that love<br>
and to the resurrection power<br>
that the darkness, as hard as it may try,<br>
can never overcome.
</p>

<p>
In the name<br>
of the Father,<br>
and of the Son,<br>
and of the Holy Spirit.
</p>

<p>
Three persons,
One God,<br>
forever and ever.
</p>

<p>
<i>Amen</i>
</p>



<div class="tagline" id="org5c71a02">
<p>
Tagged: <a href="../tags/prayer.html">Prayer</a> <a href="../tags/religion.html">Religion</a>
</p>

</div>
</div>
</section>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Jan 07, 2025.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
